{
    "HeaderAppBar": {
        "HeaderAppBar_Title": "CV and Portfolio of A. Trygve Horn",
        "Home": "Home/ Landing",
        "AboutMe": "About Me",
        "CV": "Curriculum Vitae",
        "Projects": "Projects",
        "AboutSite": "About This Site",
        "Contact": "Contact Me"
    },
    "AboutMe": {
        "AboutMe": "About Me",
        "EastLondon": "I was born in East London, South Africa, in ‘76. The area was nature-on-steroids, teeming with wild animals, jungle-like plantlife, and warm rivers and oceans. It was an amazing place in which to be a child.",
        "CapeTown": "In high school I moved to Cape Town - Still beautiful, but not quite as wild. With Table Mountain, more nightlife, amazing food and its tourist culture, Cape Town was a great place in which to be a young adult. ",
        "BucketList": "Life in South Africa gave me the opportunity to experience and be a part of some pretty amazing things, many of which seemed mundane at the time:",
        "BucketList_Item_1": "I have climbed cliffs and jumped off waterfalls",
        "BucketList_Item_2": "I have held a black mamba snake",
        "BucketList_Item_3": "I lived through the end of Apartheid…",
        "Germany": "In 2010, my wife and I moved to Germany. Germany is a beautiful country, though the nature is tamer, quieter. I miss the wildness of South Africa, but there is a lot to appreciate about Germany. Germany is so much safer than South Africa, and after many years of living in Germany I finally feel safe in my home. Germany has a far more sophisticated, if broken, public transport system. And in Germany, if you need medical care, you will get it. ",
        "Work": "I taught English for several years, and now I’m ready to go back into development. I completed a full-stack coding bootcamp and I look forward to developing apps and websites, and learning new skills along the way. "
    },
    "AboutSite": {
        "AboutSite": "AboutSite in English"
    },
    "Contact": {
        "Contact": "Contact in English"
    },
    "Landing": {
        "Loading": "Loading...",
        "errorEnglishIp": "English Location error:",
        "errorGermanIp": "German Location error:",
        "errorEnglishWeather": "English Weather error:",
        "errorGermanWeather": "German Weather error:",
        "Welcome": "Welcome to my Portfolio!",
        "DisplayLocation": "It looks like you are in or near ",
        "DisplayTime": "where the time is",
        "DisplayWeather": "and the weather is",
        "PreName": "My name is",
        "Location": ", originally from Cape town, South Africa, and now living in Solingen, Germany.",
        "LearnMore": "To learn more about me or",
        "ThisProject": "this project",
        "ProjectClick": ", click on the hamburger menu on the left of the Title Bar and select a topic of interest."
    },
    "NotFound": {
        "NotFound": "404 - Page Not Found"
    },
    "Projects": {
        "Projects": "My Projects",
        "Intro": "I have worked on a number of small projects, however a poorly planned computer migration caused an irrecoverable loss of the environment variables required to establish the API calls needed for each to work.",
        "FocusStart": "Rather than attempt to restore all of the projects, I have focussed on this portfolio, adding functionality and under-the-hood code that I invite any recruiter to examine at the",
        "FocusLink": "GitHub repo",
        "FocusOrThe": "or the",
        "FocusDescription": "descripton page",
        "FocusFinish": "for this portfolio.",
        "Plans": "Once this portfolio is fully fleshed out, I will restore my most interesting work, and create new mini projects to further develop and showcase my skills.",
        "CurrentStatus": "Until the restoration is complete, I invite you to look at my own recreation of a group project from my bootcamp:",
        "ShowMyIp": "Show My IP",
        "ShowMyIpGitHub": "GitHub Repo for Show My IP:",
        "ShowMyIpGitHubLink": "https://github.com/Thorn5/Show-My-IP-React-Vite"
    },
    "TrygveHornCV": {
        "TrygveHornCV": "TrygveHornCV in English"
    }
}