{
    "HeaderAppBar": {
        "HeaderAppBar_Title": "Lebenslauf und Portfolio von A. Trygve Horn",
        "Home": "Einstiegsseite",
        "AboutMe": "Über mich",
        "CV": "Lebenslauf",
        "Projects": "Projekte",
        "AboutSite": "Über diese Site",
        "Contact": "Kontakt"
    },
    "AboutMe": {
        "AboutMe": "Über mich",
        "EastLondon": "Ich wurde 1976 in East London, Südafrika, geboren. Die Gegend war Natur auf Steroiden, voller wilder Tiere, dschungelartiger Pflanzen und warmer Flüsse und Ozeane. Es war ein wunderbarer Ort, um Kind zu sein.",
        "CapeTown": "In der Oberstufe zog ich nach Kapstadt - immer noch schön, aber nicht ganz so wild. Mit dem Tafelberg, mehr Nachtleben, fantastischem Essen und seiner Touristenkultur war Kapstadt ein großartiger Ort, um ein junger Erwachsener zu sein.",
        "BucketList": "Das Leben in Südafrika gab mir die Möglichkeit, einige ziemlich erstaunliche Dinge zu erleben und Teil davon zu sein, von denen viele damals alltäglich erschienen:",
        "BucketList_Item_1": "Ich bin Klippen geklettert und von Wasserfällen gesprungen",
        "BucketList_Item_2": "Ich habe eine schwarze Mamba-Schlange gehalten und bin mit Haien geschwommen",
        "BucketList_Item_3": "Ich habe das Ende der Apartheid miterlebt...",
        "Germany": "2010 zogen meine Frau und ich nach Deutschland. Deutschland ist ein schönes Land, auch wenn die Natur zahmer und ruhiger ist. Ich vermisse die Wildheit Südafrikas, aber es gibt vieles an Deutschland zu schätzen. Deutschland ist so viel sicherer als Südafrika, und nach vielen Jahren in Deutschland fühle ich mich endlich sicher in meinem Zuhause. Deutschland hat ein viel ausgefeilteres, wenn auch marodes, öffentliches Verkehrssystem. Und in Deutschland bekommt man medizinische Versorgung, wenn man sie braucht.",
        "Work": "Ich habe mehrere Jahre lang Englisch unterrichtet und bin nun bereit, in die Entwicklung zurückzukehren. Ich habe einen Full-Stack-Coding-Bootcamp abgeschlossen und freue mich darauf, Apps und Websites zu entwickeln und dabei neue Fähigkeiten zu erlernen."
    },
    "AboutSite": {
        "AboutSite": "Über diese Website",
        "Framework": "Framework",
        "FrameworkText": "Dieses Vite-Projekt wurde mit React und, wo angemessen, mit Vanilla-JavaScript codiert. Ich hielt mich an den ES7-Standard und verwendete moderne Komponenten, die mit Pfeilnotation deklariert wurden. Ich beabsichtige, das Projekt in naher Zukunft in TypeScript umzuwandeln.",
        "ComponentLibrary": "Komponentenbibliothek",
        "ComponentLibraryText": "Dieses Portfolio-Projekt wurde mit Material UI entwickelt - einer Open-Source-React-Komponentenbibliothek, die Googles Material Design umsetzt. Material UI ist eine opinionated Bibliothek, die Entwicklern spezifische Designmuster und architektonische Entscheidungen auferlegt. Obwohl ich es vorziehe, mit unopinionated Bibliotheken zu arbeiten, entschied ich mich für dieses Projekt für eine restriktivere Bibliotheksart.",
        "ApiHook": "API-Fetch Hook",
        "ApiHookText": "Der API-Fetch Hook verwendet verkettete Aufrufe, um den Standort des Benutzers auf Englisch und dann auf Deutsch zu ermitteln, verarbeitet dann die Standortdaten und implementiert einen weiteren verketteten Fetch, um die aktuellen Wetterbedingungen auf Englisch und dann auf Deutsch für den scheinbaren Standort des Benutzers zu erhalten. Die Standortdaten wurden auch verwendet, um die lokale Zeit am Standort des Benutzers zu bestimmen, die auf der Landingpage angezeigt wird.",
        "ApiHookText2": "Die Codebasis enthält sowohl Code für Fetch/Catch als auch für Async/Await API-Aufrufe.",
        "Themes": "Themes",
        "ThemesText": "Ich wendete zwei Themes auf das Projekt an; eines für die App Bar am oberen Rand der Seite und ein zweites für den Inhalt des Hauptteils. Dies ermöglicht es mir, bei Bedarf verschiedene Themes auf die Schlüsselbereiche der Seite anzuwenden.",
        "LanguageSelection": "Sprachauswahl",
        "LanguageSelectionText": "Ich verwendete das i18next-Framework, um dem Benutzer die Auswahl zwischen einer englischen und einer deutschen Version der Seite zu ermöglichen. Das Framework verwendet JSON-Dateien mit Schlüssel/Wert-Einträgen in den entsprechenden Sprachen für eine schnelle Übersetzung.",
        "LanguageSelectionText2": "Durch die Einbindung in den Übersetzungsauswahlcode konnte ich den Standort, das Wetter und den Lebenslauf in der ausgewählten Sprache bereitstellen.",
        "LanguageSelectionText3": "Die i18next-Implementierung verwendet den lokalen Speicher, um die letzte Sprachauswahl zu speichern. Wenn keine Sprachauswahl gespeichert wurde, wird auf die standardmäßige englische Version zurückgegriffen.",
        "Iframe": "Lebenslauf/ iframe",
        "IframeText": "Mein Lebenslauf wird direkt von meinem Google Drive in ein iframe-Element geladen. Die ausgewählte Sprache wird ermittelt und die entsprechende Version des Lebenslaufs wird bereitgestellt.",
        "Routing": "Routing",
        "RoutingText": "Die App Bar enthält ein Hamburger-Menü mit der Website-Navigation. Jede Auswahl bewirkt, dass der Inhalt im Hauptteil unter der App Bar angezeigt wird... ziemlich Standard.",
        "RoutingText2": "Material UI verfügt über eine spezielle 'sx'-Prop, mit der die auf ein bestimmtes Element angewendete CSS modifiziert werden kann, ohne die vom Theme Context Provider vorgegebenen CSS-Parameter zu beeinträchtigen. Dies ermöglicht eine Feinabstimmung, ohne auf eine separate CSS-Datei zurückgreifen zu müssen, die die Theme-Anwendung stören könnte.",
        "Env": "Umgebungsvariablen/ Geheimnisse",
        "EnvText": "Während der Entwicklung dieses Projekts wechselte ich zu einem neuen Computer. Als ich mein Projekt von GitHub wiederherstellte, wurde mir klar, dass ich vergessen hatte, die .env-Dateien zu speichern. Dies führte zum unwiderruflichen Verlust aller Umgebungsvariablen, die sowohl die API-URLs als auch die geheimen Schlüssel enthielten.",
        "EnvText2": "Dieser Fehler lehrte mich eine wertvolle Lektion; ich nehme jetzt die API-URLs in meinen Hauptcode auf und speichere nur noch die API-Schlüssel als Umgebungsvariablen. Diese Anordnung ermöglicht eine einfachere Wiederherstellung von Projekten, da ich nur den API-Schlüssel abrufen muss und die URLs selbst wiederhergestellt werden, wenn das Repository geklont wird."
    },
    "Contact": {
        "Contact": "Kontaktieren Sie mich",
        "ContactInvite": "Wenn Sie Fragen zu dieser Website haben oder wenn Sie mich wegen möglicher Anstellungen kontaktieren möchten, erreichen Sie mich unter:",
        "ContactEmail": "E-Mail:",
        "Landline": "Festnetz: +49 (0) 212 64573450",
        "Cell": "Mobil: +49 (0) 170 4772434",
        "salutation": "Bis später und danke für Ihren Besuch!"
    },
    "Landing": {
        "Loading": "Die Seite wird geladen...",
        "error": "Hmm, bei der ersten Datenabfrage ist etwas schiefgelaufen. Bitte benutzen Sie das Hamburger-Menü oben links, um durch die Website zu navigieren. Der Rest der Website sollte einwandfrei funktionieren.",
        "Welcome": "Willkommen in meinem Portfolio!",
        "DisplayLocation": "Ihre IP-Adresse deutet darauf hin, dass Sie sich in oder in der Nähe von ",
        "DisplayTime": "aufhalten, wo die Zeit ist",
        "DisplayWeather": "und das Wetter ist:",
        "PreName": "Mein Name ist",
        "Location": ", ursprünglich aus Kapstadt, Südafrika, und jetzt lebe ich in Solingen, Deutschland.",
        "LearnMore": "Um mehr über mich oder",
        "ThisProject": "dieses Projekt",
        "ProjectClick": " zu erfahren, klicken Sie auf das Hamburger-Menü links in der Titelleiste und wählen Sie ein interessantes Thema aus."
    },
    "NotFound": {
        "NotFound": "404 - Seite nicht gefunden"
    },
    "Projects": {
        "Projects": "Meine Projekte",
        "Intro": "Ich habe an einer Reihe kleiner Projekte gearbeitet, jedoch führte eine schlecht geplante Computermigration zu einem unwiederbringlichen Verlust der Umgebungsvariablen, die für die erforderlichen API-Aufrufe benötigt wurden, damit jedes Projekt funktionieren konnte.",
        "FocusStart": "Anstatt zu versuchen, alle Projekte wiederherzustellen, habe ich mich auf dieses Portfolio konzentriert und Funktionalität sowie Code unter der Haube hinzugefügt, den ich jeden Recruiter einlade, im ",
        "FocusLink": "GitHub-Repository",
        "FocusOrThe": "oder auf",
        "FocusDescription": "der Beschreibungsseite",
        "FocusFinish": "dieses Portfolios zu untersuchen.",
        "Plans": "Sobald dieses Portfolio vollständig ausgearbeitet ist, werde ich meine interessantesten Arbeiten wiederherstellen und neue Miniprojekte erstellen, um meine Fähigkeiten weiter zu entwickeln und zu präsentieren.",
        "CurrentStatus": "Bis die Wiederherstellung abgeschlossen ist, lade ich Sie ein, sich meine eigene Nachbildung eines Gruppenprojekts aus meinem Bootcamp anzusehen:",
        "ShowMyIp": "Show My IP ",
        "ShowMyIpConnector": "oder das ",
        "ShowMyIpGitHub": "GitHub-Repository für Show My IP.",
        "BrewXotic": "Sie können auch mein Bootcamp-Miniprojekt ansehen: ",
        "BrewXoticLink": "den BrewXotic Online-Shop",
        "BrewXoticConnector": ", sowie das ",
        "BrewXoticFrontEnd": "Frontend-GitHub-Repo",
        "BrewXoticConnector2": " oder das ",
        "BrewXoticBackEnd": "Backend-GitHub-Repo",
        "BrewXoticConclude": " für BrewXotic.",
        "BrewXoticWarning": "Bitte haben Sie Geduld! Die Datenbank kann einige Zeit in Anspruch nehmen, um hochgefahren zu werden."
    },
    "TrygveHornCV": {
        "TrygveHornCV": "Lebenslauf"
    }
}